{
	"@metadata": {
		"authors": [
			"AnakngAraw"
		]
	},
	"maps-desc": "Nagpapagana ng pagbabaon ng gumagalaw na mga mapa papaloob sa mga pahina ng wiki, pagkokodigong pangheograpiya ng mga tirahan at ibang mga gawaing pangheograpiya. ([http://mapping.referata.com/wiki/Examples mga pagpapatunghay])\n\nkakayahang ipakita ang dato ng tugmaang-pampook sa loob ng mga mapa, at mga triahan ([http://mapping.referata.com/wiki/Maps_examples mga pagpapatunghay])",
	"right-geocode": "Kodigong pangheograpiya",
	"maps_map": "Mapa",
	"maps-loading-map": "Ikinakarga ang mapa...",
	"maps-load-failed": "Hindi maikarga ang mapa!",
	"maps-markers": "Mga palatandaan",
	"maps-copycoords-prompt": "CTRL+C, ENTER",
	"maps-searchmarkers-text": "Mga pangmarka ng pansala",
	"maps-others": "iba pa",
	"maps-ns-layer": "Patong",
	"maps-ns-layer-talk": "Usapan sa patong",
	"maps-layer-property": "Ari-arian",
	"maps-layer-value": "Halaga",
	"maps-layer-errors": "Mga kamalian",
	"maps-error-invalid-layertype": "Walang mga patong ng uring \"$1\".  Tanging {{PLURAL:$3|ganitong uri|ganitong mga uri}} lamang ang tinatangkilik: $2",
	"maps-error-no-layertype": "Kailangan mong tukuyin ang uri ng patong. {{PLURAL:$2|Ganitong uri lamang ang|Ganitong mga uri ang}} tinatangkilik: $1",
	"validation-error-invalid-layer": "Ang parametrong $1 ay dapat na isang tanggap na patong.",
	"validation-error-invalid-layers": "Ang parametrong $1 ay dapat na isa o mahigit pang katanggap-tanggap na mga patong.",
	"maps-layer-of-type": "Patong ng uring $1",
	"maps-layer-type-supported-by": "Ang ganitong uri ng patong ay {{PLURAL:$2|magagamit lamang sa $1 na palingkuran ng pagmamapa|magagamit lamang sa ganitong mga palingkuran ng pagmamapa: $1}}.",
	"maps-coordinates-description": "Kawint ng banghay upang maianyo ang mga tugmaang-pampook, magmula at papunta sa anuman sa tinatangkilik na mga anyo.",
	"maps-displaymap-description": "Ipakita ang mga mapang pangheograpiya na walang anumang tinukoy na pangwiking mga pananda sa ibabaw nila.",
	"maps-displaypoint-description": "Ipakita ang mga mapang pangheograpiya na may isa o higit pang tinukoy na pangwiking mga pananda sa ibabaw nila.",
	"maps-distance-description": "Palitan ang isang kalayuan na ginagamit ang isang partikular na sinusuportahang yunit papunta sa katumbas nito na ginagamit ang isa pang yunit.",
	"maps-finddestination-description": "Maghanap ng isang patutunguhan na binigyan ng tuldok ng pagsisimula (na maaaring nasa loob ng anuman sa tinatangkilik na mga anyo), isang paunang kapupuntahan at isang layo.",
	"maps-geocode-description": "Nagpapagana ng pagsasakodigo na pangheograpiya ng mga tirahan, na sa ibang pananalita ay ang pagpapaglit ng mga kinalalagyan na mababasa ng tao upang maging mga pangkat ng mga tugmaang pampook. Mayroong suporta para sa ilang mga paglilingkod na pangkodigo ng heograpiya, na hindi dapat ikalito sa mga paglilingkod ng pagmamapa.",
	"maps-geodistance-description": "Tuusin ang pangheograpiyang layo sa pagitan ng dalawang mga tuldok, magmula at papunta sa anumang tinatangkilik na mga anyo.",
	"maps-mapsdoc-description": "Magpakita ng isang talahanayan na mayroong mga parametro para sa isang tinukoy na palingkuran ng pagmamapa na kasama ang kanilang likas na nakatakdang mga halaga at mga paglalarawan.",
	"maps-mapsdoc-par-service": "Ang palingkuran ng pagmamapa na pagpapakitaan ng kasulatan ng parametro.",
	"maps-mapsdoc-par-language": "Ang wikang pagpapakitaan ng kasulatan. Kung walang ganiyang salinwikang makukuha, Ingles sa halip niyan ang gagamitin.",
	"maps-coordinates-par-location": "Ang mga tugmaang-pampook na nais mong iayos ang anyo.",
	"maps-coordinates-par-format": "Ang pinupukol na anyo para sa mga tugmaang-pampook.",
	"maps-coordinates-par-directional": "Nagpapahiwatig kung ang mga tugmaang-pampook ay dapat na ilabas bilang pangpatutunguhan o hindi.",
	"maps-distance-par-distance": "Ang layo na gagawing katumbas nito na may tinukoy na yunit.",
	"maps-distance-par-decimals": "Ang pinakamataas na bilang ng kakarampot na mga tambilang na gagamitin sa kalalabasang halaga.",
	"maps-distance-par-unit": "Ang yunit na kalalabasan ng layo.",
	"maps-finddestination-par-location": "Ang paunang kinalalagyan.",
	"maps-finddestination-par-bearing": "Ang paunang patutunguhan.",
	"maps-finddestination-par-distance": "Ang layo ng lalakbayin.",
	"maps-finddestination-par-format": "Ang anyo kung paano ilalabas ang patutunguhan.",
	"maps-finddestination-par-directional": "Nagpapahiwatig kung ang anyo ng patutunguhan ay dapat na maka kapupuntahan o hindi.",
	"maps-finddestination-par-allowcoordinates": "Nagpapahiwatig kung mga tugmaang pampook ay dapat na payagan. Kung nakatakda sa hindi, mga tirahan lamang ang tatanggapin.",
	"maps-finddestination-par-geoservice": "Ang palingkuran ng pagkokodigo na pangheograpiya na gagamitin sa pagkokodigo na pangheograpiya ng halaga sa pagkakataon na ito ay isang tirahan.",
	"maps-finddestination-par-mappingservice": "Parametro na magpapahiwatig ng paglilingkod ng pagmamapa na gagamitin sa tungkuling ito.\nPapahintulutan nito ang mga mapa na mapangibabawan ang likas na nakatakdang halaga ng parametro ng paglilingkod sa pamamagitan ng isa na pinakamainam ang kalagayan para sa paglilingkod ng pagmamapa.\n(Halimbawa: Sa kaso ng Google Maps, gagamitin ang pangkodigo na pangheograpiya ng Google.)",
	"maps-geocode-par-location": "Ang tirahan na nais mong ikodigong pangheograpiya.",
	"maps-geocode-par-mappingservice": "Ang paglilingkod na pangkodigo ng heograpiya na nais mong gamitin. Tingnan ang makukuhang mga palingkuran ng pagkokodigo ng heograpiya.",
	"maps-geocode-par-geoservice": "Nagpapahintulot ang parametrong ito na maipahiwatig na ginagamit mo ang kahilingang ito ng pagsasakodigo na pangheograpiya na katambal ang isang tiyak na paglilingkod ng pagmamapa. Bawat isang serbisyo ng pagmamapa ay maaaring magkaroon ng mga pampangibabaw sa likas na nakatakdang halaga para sa paglilingkod na pangkodigo ng heograpiya. Ito ay para sa mga pagsasaalang-alang na pambatas, dahil sa hindi mo maaaring gamitin ang palingkuran ng Google Geocoding maliban na lamang kung kapiling ng Google Maps. Ang pagtatakda ng parametrong ito at hindi ng parametro para sa serbisyo ay makapagtitiyak na hindi ka gumagamit ng isang hindi katanggap-tanggap na tambalan.",
	"maps-geocode-par-allowcoordinates": "Nagpapahintulot ng hindi pagpapagana ng suporta para sa mga tugmaang pampook na nasa loob ng tungkuling ito. Dapat na maging oo o kaya huwag.\nKapag huwag, ang bawat isang halaga ay ikokodigo na pangheograpiya, pati na ang katanggap-tanggap na mga tugmaang pampook.",
	"maps-geocode-par-format": "Ang anyo para sa kinalalabasang mga tugmaang pampook.",
	"maps-geocode-par-directional": "Nagpapahiwatig kung ang mga tugmaang-pampook ay dapat na ilabas bilang pangpatutunguhan o hindi.",
	"maps-geodistance-par-location1": "Ang unang tuldok sa loob ng isang pangkat upang tuusin ang layo sa pagitan.",
	"maps-geodistance-par-location2": "Ang pangalawang tuldok sa loob ng isang pangkat upang tuusin ang layo sa pagitan.",
	"maps-geodistance-par-unit": "Ang yunit na kinapapalooban ng kinalalabasan ng layo.",
	"maps-geodistance-par-decimals": "Ang pinakamataas na bilang ng kakarampot na mga tambilang na gagamitin sa kalalabasang halaga.",
	"maps-geodistance-par-mappingservice": "Ang palingkuran ng pagkokodigong pangheograpiya na gagamitin upang maikodigong pangheograpiya ang anumang mga tirahan.",
	"maps-geodistance-par-geoservice": "Ang paglilingkod na pangmapa na pinaggagamitan na kasama ito.\nMakakaapekto ito sa likas na nakatakdang halaga ng paglilingkod na pangheograpiya.",
	"maps-displaymap-par-mappingservice": "Nagpapahintulot na maitakda ang palingkuran ng pagmamapa na gagamitin upang likhain ang mapa.",
	"maps-displaymap-par-coordinates": "Ang kinalalagyan na paunang pagpapagitnaan ng mapa.",
	"maps-displaymap-par-zoom": "Nagpapahintulot sa pagtatakda ng antas ng paglapit ng mapa.\nKapag hindi ibinigay at mayroong maramihang mga pananda sa ibabaw ng mapa, kukunin ang pinakaangkop na paglapit, hindi ang maiaayos na likas na katakdaan.",
	"maps-displaymap-par-centre": "Nagbibigay-daan sa pagtatakda ng mga tugmaang pampook ng gitna ng mapa para sa (mga) tuldok_na_ipapakita.\nTumatanggap kapwa ng mga tirahan o mga tugmaang pampook.\nKapag hindi ibinigay ang pag-aaring ito, igigitna ng mapa ang kanyang sarili sa ibinigay na pangmarka, o sa gitna ng ibinigay na mga pananda.",
	"maps-displaymap-par-title": "Nagpapahintulot sa pagtatakda ng teksto na ipapakita sa loob ng mga pagsulpot ng lahat ng mga pangmarka na walang tiyak na pamagat.\nKapag ginamit na kasama ng katatakan, ang pamagat ay magiging makapal at mayroong salungguhit.",
	"maps-displaymap-par-label": "Nagpapahintulot sa pagtatakda ng teksto na ipapakita sa loob ng mga pagsulpot ng lahat ng mga pangmarka na walang tiyak na katatakan.",
	"maps-displaymap-par-icon": "Nagpapahintulot sa pagtatakda ng ginagamit na kinatawang larawang para sa lahat ng mga pananda.",
	"validation-error-invalid-location": "Ang parametrong $1 ay dapat na isang tanggap na lokasyon.",
	"validation-error-invalid-locations": "Ang parametrong $1 ay dapat na isa o mahigit pang tanggap na mga lokasyon.",
	"validation-error-invalid-width": "Ang parametrong $1 ay dapat na isang tanggap na lapad.",
	"validation-error-invalid-height": "Ang parametrong $1 ay dapat na isang tanggap na taas.",
	"validation-error-invalid-distance": "Ang parametrong $1 ay dapat na isang tanggap na layo.",
	"validation-error-invalid-distances": "Ang parametrong $1 ay dapat na isa o mahigit pang tanggap na mga layo.",
	"validation-error-invalid-image": "Ang parametrong $1 ay dapat na isang katanggap-tanggap na larawan.",
	"validation-error-invalid-images": "Ang parametrong $1 ay dapat na isa o mahigit pang katanggap-tanggap na mga larawan.",
	"validation-error-invalid-goverlay": "Ang parametrong $1 ay dapat na isang tanggap na patong.",
	"validation-error-invalid-goverlays": "Ang parametrong $1 ay dapat na isa o mahigit pang katanggap-tanggap na mga patong.",
	"maps-abb-north": "H",
	"maps-abb-east": "S",
	"maps-abb-south": "T",
	"maps-abb-west": "K",
	"maps-latitude": "Latitud:",
	"maps-longitude": "Longhitud:",
	"maps-invalid-coordinates": "Hindi kinilala ang halagang $1 bilang isang tanggap na pangkat ng mga tugmaang-pampook.",
	"maps_coordinates_missing": "Walang mga tugmaang-pampook na ibinigay para sa mapa.",
	"maps_geocoding_failed": "Hindi mageokodigo ang sumusunod na {{PLURAL:$2|tirahan|mga tirahan}}:  $1.",
	"maps_geocoding_failed_for": "Hindi mageokodigo ang sumusunod na {{PLURAL:$2|tirahan|mga tirahan}} at {{PLURAL:$2|tinanggal|mga tinanggal}} na mula sa mapa:\n$1",
	"maps_unrecognized_coords": "Hindi kinilala ang sumusunod na {{PLURAL:$2|tugmaan|mga tugmaan}}: $1.",
	"maps_unrecognized_coords_for": "Hindi nakilala ang sumusunod na {{PLURAL:$2|tugmaang pampook|mga tugmaang pampook}} at {{PLURAL:$2|inalis|mga inalis}} na mula sa mapa:\n$1",
	"maps_map_cannot_be_displayed": "Hindi maipapakita ang mapa.",
	"maps-geocoder-not-available": "Wala ang katangiang-kasangkapang pang-geokodigo ng Mga Mapa.  Hindi mageokodigo ang lokasyon mo.",
	"maps_googlemaps3": "Google Maps v3",
	"maps_openlayers": "OpenLayers",
	"maps_osm": "OpenStreetMap",
	"maps_click_to_activate": "Pindutin upang mabuhay ang mapa",
	"maps_centred_on": "Nakagitna ang mapa sa $1, $2.",
	"maps-par-resizable": "Nakagagawang mababago ang sukat ng mapa sa pamamagitan ng pagkaladkad doon sa pang-ibabang kanang sulok nito.",
	"maps-par-geoservice": "Ang gagamiting palingkuran ng pagkokodigo na pangheograpiya upang makagawa ng mga salinwika sa pagitan ng mga tirahan at mga tugmaang pampook.",
	"maps-par-zoom": "Ang antas ng paglapit para sa mapa. Para sa mga mapang mayroong mga pangmarka, ito ay likas na nakatakda sa pinaka malapit na antas ng pagkakatutok na nagpapakita pa rin ng lahat ng mga pangmarka.",
	"maps-par-width": "Nagpapahintulot ng pagtatakda ng lapad ng mapa. Ayon sa likas na pagkakatakda, ang mga piksel ay ipapalagay bilang yunit, subalit maaari mong maliwanag na tukuyin ang isa sa mga yunit na ito: px, ex, em, %.",
	"maps-par-height": "Nagpapahintulot ng pagtatakda ng taas ng mapa. Ayon sa likas na pagkakatakda, ang mga piksel ay ipapalagay bilang yunit, subalit maaari mong maliwanag na tukuyin ang isa sa mga yunit na ito: px, ex, em, %.",
	"maps-googlemaps3-incompatbrowser": "Ang pantingin-tingin mo ay hindi katambal ng Mga Mapa ng Google v3.",
	"maps-googlemaps3-par-type": "Ang uri ng mapa na unang ipapakita.",
	"maps-googlemaps3-par-types": "Ang mga uri ng mapa na magiging makukuha sa pamamagitan ng pantaban ng uri.",
	"maps-googlemaps3-par-layers": "Natatanging mga patong na ikakarga sa ibabaw ng mapa.",
	"maps-googlemaps3-par-controls": "Ang mga pantaban na ilalagay sa ibabaw ng mapa.",
	"maps-googlemaps3-par-zoomstyle": "Ang estilo ng pantaban ng paglapit.",
	"maps-googlemaps3-par-typestyle": "Ang estilo ng pantaban ng uri.",
	"maps-googlemaps3-par-autoinfowindows": "Kusang buksan ang lahat ng mga dungawan ng kabatiran pagkaraang maikarga ang pahina.",
	"maps-googlemaps3-par-kml": "Mga talaksan ng Wikang Pangmarka ng Butas ng Susian (Keyhole Markup Language, KML) na ikakarga sa ibabaw ng mapa.",
	"maps-googlemaps3-par-gkml": "Mga talaksan ng Wikang Pangmarka ng Butas ng Susian (Keyhole Markup Language, KML) na pinasisinayahan ng Google upang ikarga sa ibabaw ng mapa.",
	"maps-googlemaps3-par-fusiontables": "Mga ID ng mga Talahanayan ng Pagtutumbaga ng Google na dapat ikarga sa ibabaw ng mapa.",
	"maps-googlemaps3-par-tilt": "Pagkiling para sa Mapa kapag ginagamit ang Mga Mapa ng Google.",
	"maps-googlemaps3-par-kmlrezoom": "Muling ilapit ang mapa pagkaraang maikarga na ang mga patong ng Wika ng Pangmarka ng Butas ng Susian (Keyhole Markup Language, KML).",
	"maps-googlemaps3-par-poi": "Ipakita ang mga tuldok na mapagtutuunan ng pansin.",
	"maps-openlayers-par-controls": "Ang mga pantaban na ilalagay sa ibabaw ng mapa.",
	"maps-openlayers-par-layers": "Ang mga patong ay magiging makukuha sa loob ng pilian ng patong. Ang unang patong ay ipapakita kapag kumarga na ang mapa.",
	"maps-osm-par-thumbs": "Ipakita ang mga kagyat",
	"maps-osm-par-photos": "Ipakita ang mga larawan",
	"mapeditor": "Patnugot ng mapa",
	"specialpages-group-maps": "Mga mapa",
	"mapeditor-parser-error": "Naganap ang isang kamalian noong binabanghay ang metadato. Hindi papansinin ang ipinasok ng tagagamit.",
	"mapeditor-none-text": "Wala",
	"mapeditor-done-button": "Nagawa na",
	"mapeditor-remove-button": "Tanggalin",
	"mapeditor-import-button2": "Angkatin",
	"mapeditor-export-button": "Iluwas na papunta sa kodigo ng wiki",
	"mapeditor-import-button": "Angkatin magmula sa kodigo ng wiki",
	"mapeditor-mapparam-button": "Baguhin ang mga parametro ng mapa",
	"mapeditor-clear-button": "Hawiin ang mapa",
	"mapeditor-code-title": "Kodigo ng wiki",
	"mapeditor-import-title": "Angkatin ang kodigo ng wiki",
	"mapeditor-import-note": "Paki tandaan na ang pambanghay ay umaasa ng isang napaka higpit na kaanyuan sa kodigo ng wiki. Ang ipinasok na kodigo rito ay dapat na tumugma sa kodigong inilibas ng panunungkulan ng pagluluwas.",
	"mapeditor-form-title": "Baguhin ang mga detalye",
	"mapeditor-link-title-switcher-popup-text": "Pagsulpot na mayroong teksto",
	"mapeditor-link-title-switcher-link-text": "Kawing",
	"mapeditor-form-field-title": "Pamagat",
	"mapeditor-form-field-text": "Teksto",
	"mapeditor-form-field-link": "Kawing",
	"mapeditor-form-field-icon": "Kinatawang larawan",
	"mapeditor-form-field-group": "Pangkat",
	"mapeditor-form-field-inlinelabel": "Katatakang nasa guhit",
	"mapeditor-form-field-strokecolor": "Kulay ng hagod",
	"mapeditor-form-field-strokeopacity": "Kalabuan ng hagod",
	"mapeditor-form-field-strokeweight": "Bigat ng hagod",
	"mapeditor-form-field-fillcolor": "Kulay ng buhos",
	"mapeditor-form-field-fillopcaity": "Kalabuan ng buhos",
	"mapeditor-form-field-showonhover": "Ipakita lamang sa pag-aligid",
	"mapeditor-mapparam-title": "Baguhin ang mga parametro ng mapa",
	"mapeditor-mapparam-defoption": "-Piliin ang parametro-",
	"mapeditor-imageoverlay-button": "Idagdag ang kalupkop ng larawan",
	"mapeditor-form-field-image": "Larawan",
	"mapeditor-imageoverlay-title": "Mga detalye ng kalupkop ng larawan",
	"mapeditor-form-field-visitedicon": "Kinatawang larawan ng pagka nadalaw"
}
