<?php

$languageNames = array(
'cay' => 'ᎦᏳᎦ',
'cho' => 'ᎠᏣᏗ',
'chr' => 'ᏣᎳᎩ',
'de' => 'ᎠᏂᏓᏥ',
'en' => 'ᎩᎵᏏ',
'es' => 'ᏍᏆᏂ',
'fr' => 'ᎦᎸᏥ',
'it' => 'ᎬᏩᎵᏲᏥᎢ',
'ja' => 'ᏣᏩᏂᏏ',
'moh' => 'ᎼᎻᎦ',
'mus' => 'ᎠᎫᏌ',
'pt' => 'ᏉᏧᎦᎵ',
'ru' => 'ᏲᏂᎢ',
'see' => 'ᏏᏂᎦ',
'und' => 'ᏄᏬᎵᏍᏛᎾ ᎦᏬᏂᎯᏍᏗ',
'zh' => 'ᏓᎶᏂᎨ',
);

$currencyNames = array(
'BRL' => 'ᏆᏏᎵᎢ ᎠᏕᎳ',
'CAD' => 'ᎧᎾᏓ ᎠᏕᎳ',
'CNY' => 'ᏓᎶᏂᎨ ᎠᏕᎳ',
'EUR' => 'ᏳᎳᏛ',
'GBP' => 'ᎩᎵᏏᏲ ᎠᏕᎳ',
'INR' => 'ᎢᏅᏗᎾ ᎠᏕᎳ',
'JPY' => 'ᏣᏩᏂᏏ ᎠᏕᎳ',
'MXN' => 'ᏍᏆᏂ ᎠᏕᎳ',
'RUB' => 'ᏲᏂᎢ ᎠᏕᎳ',
'USD' => 'ᎤᏃᏍᏗ',
);

$countryNames = array(
'BR' => 'ᏆᏏᎵᎢ',
'CA' => 'ᎨᎾᏓ',
'CN' => 'ᏓᎶᏂᎨᏍᏛ',
'DE' => 'ᎠᏂᏛᏥ',
'FR' => 'ᎦᎸᏥᏱ',
'GB' => 'ᎩᎵᏏᏲ',
'IN' => 'ᎢᏅᏗᎾ',
'IT' => 'ᏲᎶ',
'JP' => 'ᏣᏩᏂᏏ',
'MX' => 'ᏍᏆᏂᏱ',
'RU' => 'ᏲᏂᎢ',
'US' => 'ᎠᎹᏰᏟ',
);
