<?php

$languageNames = array(
'ar' => 'Арабча',
'de' => 'Олмонча',
'en' => 'Инглизча',
'es' => 'Испанча',
'fr' => 'Французча',
'hi' => 'Ҳиндча',
'it' => 'Италянча',
'ja' => 'Японча',
'pt' => 'Португалча',
'ru' => 'Русча',
'uz' => 'Ўзбек',
'zh' => 'Хитойча',
);

$currencyNames = array(
'BRL' => 'Бразил реали',
'CNY' => 'Хитой юани',
'EUR' => 'Евро',
'GBP' => 'Инглиз фунт стерлинги',
'INR' => 'Ҳинд рупияси',
'JPY' => 'Япон йенаси',
'RUB' => 'Рус рубли',
'USD' => 'АҚШ доллари',
'UZS' => 'Ўзбекистон сўм',
);

$countryNames = array(
'AF' => 'Афғонистон',
'BR' => 'Бразилия',
'CN' => 'Хитой',
'DE' => 'Олмония',
'FR' => 'Франция',
'GB' => 'Бирлашган Қироллик',
'IN' => 'Ҳиндистон',
'IT' => 'Италия',
'JP' => 'Япония',
'RU' => 'Россия',
'US' => 'Қўшма Штатлар',
'UZ' => 'Ўзбекистон',
);
