<?php

$languageNames = array(
'as' => 'অসমীয়া',
'ie' => 'উপস্থাপন ভাষা',
'km' => 'কম্বোডিয়ান',
);

$countryNames = array(
'AQ' => 'এন্টাৰ্টিকা',
'BR' => 'ব্ৰাজিল',
'BV' => 'বভেট দ্বীপ',
'CN' => 'চীন',
'DE' => 'জাৰ্মানি',
'FR' => 'ফ্ৰান্স',
'GB' => 'সংযুক্ত ৰাজ্য',
'GS' => 'দক্ষিণ জৰ্জিয়া আৰু দক্ষিণ চেণ্ডৱিচ্‌ দ্বীপ',
'HM' => 'হাৰ্ড দ্বীপ আৰু মেক্‌ডোনাল্ড দ্বীপ',
'IN' => 'ভাৰত',
'IO' => 'ব্ৰিটিশ্ব ইণ্ডিয়ান মহাসাগৰৰ অঞ্চল',
'IT' => 'ইটালি',
'JP' => 'জাপান',
'RU' => 'ৰুচ',
'TF' => 'দক্ষিণ ফ্ৰান্সৰ অঞ্চল',
'US' => 'যুক্তৰাষ্ট্ৰ',
);
