<?php

$messages = array_merge( $messages, array(
'editingTips' => '= Как се оформя текст =
Текстовете могат да бъдат оформяни с помощта на \'уики-маркерен език\' или HTML.

<br />
<span style="font-family: courier"><nowiki>\'\'курсив\'\'</nowiki></span> => \'\'курсив\'\'

<br />
<span style="font-family: courier"><nowiki>\'\'\'получер\'\'\'</nowiki></span> => \'\'\'получер\'\'\'

<br />
<span style="font-family: courier"><nowiki>\'\'\'\'\'курсив и получер\'\'\'\'\'</nowiki></span> => \'\'\'\'\'курсив и получер\'\'\'\'\'

----

<br />
<nowiki><s>задраскване</s></nowiki> => <s>задраскване</s>

<br />
<nowiki><u>подчертаване</u></nowiki> => <u>подчертаване</u>

<br />
<nowiki><span style="color:red;">текст в червено</span></nowiki> => <span style="color:red;">текст в червено</span>

=Как се създават препратки=
Препратките се създават с единични или двойни квадратни скоби.

<br />
\'\'\'Обикновена вътрешна препратка:\'\'\'<br />
<nowiki>[[Препратка]]</nowiki>

<br />
\'\'\'Вътрешна перпратка с описание:\'\'\'<br />
<nowiki>[[Препратка|описание на препратката]]</nowiki>

<br />
----

<br />
\'\'\'Номерирана външна препратка:\'\'\'<br />
<nowiki>[http://www.example.com]</nowiki>

<br />
\'\'\'Външна препратка с описателен текст:\'\'\'

<nowiki>[http://www.example.com описание на препратката]</nowiki>

=Как се добавят раздели=
Разделите се създават със знак за равенство. Повече "=" създават по-малък раздел.
Раздел 1 е запазен за името на страницата.

<br />
<span style="font-size: 1.6em"><nowiki>==Раздел 2==</nowiki></span>

<br />
<span style="font-size: 1.3em"><nowiki>===Раздел 3===</nowiki></span>

<br />
<nowiki>====Раздел 4====</nowiki>

=Как се създава отстъп=
Отстъпите биват 3 вида - обикновен, с точки или номерирани.

<br />
<nowiki>: отстъп</nowiki><br />
<nowiki>: отстъп</nowiki><br />
<nowiki>:: по-голям отстъп от горния</nowiki><br />
<nowiki>::: още по-голям отстъп</nowiki>

<br />
<nowiki>* точка</nowiki><br />
<nowiki>* точка</nowiki><br />
<nowiki>** подточка</nowiki><br />
<nowiki>* точка</nowiki>

<br />
<nowiki># номериран списък</nowiki><br />
<nowiki># номериран списък</nowiki><br />
<nowiki>## подсписък</nowiki><br />
<nowiki># номериран списък</nowiki>

=Как се вмъкват картинки=
Картинките се добавят и форматират по подобен начин като препратките.

<br />
<nowiki>[[Image:Име.jpg]]</nowiki>

<br />
\'\'\'за добавяне на описателен текст\'\'\'<br />
<nowiki>[[Image:Име.jpg|описателен текст]]</nowiki>

<br />
\'\'\'За създаване на миникартинка\'\'\'<br />
<nowiki>[[Image:Име.jpg|thumb|]]</nowiki>

<br />
\'\'\'За посочване размера на картинката\'\'\'<br />
<nowiki>[[Image:Име.jpg|200px|]]</nowiki>

<br />
\'\'\'За подравняване на картинката\'\'\'<br />
<nowiki>[[Image:Име.jpg|right|]]</nowiki>

<br />
Тези атрибути могат да се комбинират като между тях се поставя отвесна черта "|". Необходимо е да се знае, че всичко след последната отвесна черта се приема за текст.',
) );
