/**
 * InScript regular expression rules table for Tamil
 * @author Amir E. Aharoni ([[User:Amire80]])
 * based on the Malayalam map by
 * @author Junaid P V ([[User:Junaidpv]])
 * and Fedora Tamil keyboard layout:
 * http://fedoraproject.org/wiki/I18N/Indic/TamilKeyboardLayouts
 * @date 2011-11-29
 * License: GPLv3
 */
var rules = [
['`', '', 'ொ'],
['~', '', 'ஒ'],

['&', '', 'க்ஷ்'],
['\\*', '', 'ஷ்ர'],

['\\(', '', '\u200D'], // ZWJ
['\\)', '', '\u200C'], // ZWNJ

['_', '', 'ஃ'],

['q', '', 'ௌ'],
['Q', '', 'ஔ'],
['w', '', 'ை'],
['W', '', 'ஐ'],
['e', '', 'ா'],
['E', '', 'ஆ'],
['r', '', 'ீ'],
['R', '', 'ஈ'],
['t', '', 'ூ'],
['T', '', 'ஊ'],
['u', '', 'ஹ'],
['U', '', 'ங'],
['p', '', 'ஜ'],
['\\}', '', 'ஞ'],

['a', '', 'ோ'],
['A', '', 'ஓ'],
['s', '', 'ே'],
['S', '', 'ஏ'],
['d', '', '்'],
['D', '', 'அ'],
['f', '', 'ி'],
['F', '', 'இ'],
['g', '', 'ு'],
['G', '', 'உ'],
['h', '', 'ப'],
['j', '', 'ர'],
['J', '', 'ற'],
['k', '', 'க'],
['l', '', 'த'],
[';', '', 'ச'],
['\'', '', 'ட'],

['z', '', 'ெ'],
['Z', '', 'எ'],
['x', '', 'ஂ'],
['c', '', 'ம'],
['C', '', 'ண'],
['v', '', 'ந'],
['V', '', 'ன'],
['b', '', 'வ'],
['B', '', 'ழ'],
['n', '', 'ல'],
['N', '', 'ள'],
['m', '', 'ஸ'],
['M', '', 'ஶ'],
['<', '', 'ஷ'],
['/', '', 'ய'],

['\\.', '', '\u0BE4'],

['1', '', '௧'],
['2', '', '௨'],
['3', '', '௩'],
['4', '', '௪'],
['5', '', '௫'],
['6', '', '௬'],
['7', '', '௭'],
['8', '', '௮'],
['9', '', '௯'],
['0', '', '௦']
];

var rules_x = [
['X', '', 'ௐ'],
['\\.', '', '\u0BE5'],
['\\)', '', '௰'],
['-', '', '௱'],
['=', '', '௲'],
['n', '', '௳'],
['c', '', '௴'],
['b', '', '௵'],
['h', '', '௶'],
['y', '', '௷'],
['C', '', '௸'],
[',', '', '௹'],
['V', '', '௺'],
['4', '', '₹']
];

jQuery.narayam.addScheme( 'ta-inscript', {
	'namemsg': 'narayam-ta-inscript',
	'extended_keyboard': true,
	'lookbackLength': 0,
	'keyBufferLength': 0,
	'rules': rules,
	'rules_x': rules_x
} );
